# GetCenterlineCurves Method

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
RebarContainerItem..::..GetCenterlineCurves Method
RebarContainerItem Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetCenterlineCurves(Boolean, Boolean, Boolean) | A chain of curves representing the centerline of the rebar. |
| GetCenterlineCurves(Boolean, Boolean, Boolean, MultiplanarOption) | A chain of curves representing the centerline of the rebar. |

# See Also
RebarContainerItem Class
RebarContainerItem Members
Autodesk.Revit.DB.Structure Namespace